[
  {
    "IDs":321098,
    "Content":"Essay on Dr. B. R. Ambedkar’s views on women empowerment",
    "Link":"http://www.brainly.in/question/321098",
    "Answer":"***************************************************************************************************\nDr.B.R.Ambedkar’s views on women empowerment\n***************************************************************************************************\nDr.B.R.Ambedkar was a great supporter for women empowerment. He strongly believed in the capabilities of women, he also emphasized that a nation’s progress could not be successful without improving the condition of women in society. Empowerment of women and improving their political, social and economic status is highly important for sustaining development. He also believed Buddhism is the only means to eliminate inequalities in society and women to attain dignified status in society.\n\nAs a chairman of Drafting Committee, he provided strong constitutional protection to women by incorporating"
  },
  {
    "IDs":321132,
    "Content":"Poem on Dr. B. R. Ambedkar’s views on women empowerment",
    "Link":"http://www.brainly.in/question/321132",
    "Answer":"---------------------------------------------------------------------------------------------- Dr. B. R. Ambedkar and views on women empowerment\n----------------------------------------------------------------------------------------------- \nA Women can do anything, \nIf power and wisdom is given to her \nonce try and see by giving her the rights and power & wisdom, \nonce the women will be on the race of life in the society. \nThere will be none who can stop this race where, \nthere will be all the winners and none are losers.\nOnce the women are in the action plan of the empowerment,\nWe know the stars will shine high in the sky,\nThe women now will shine as bright as the sun, being stars in the sky."
  },
  {
    "IDs":321100,
    "Content":"Poem on What do I know about Dr. B. R. Ambedkar",
    "Link":"http://www.brainly.in/question/321100",
    "Answer":"----------------------------------------------------------------------------------------------- Dr. B. R Ambedkar \n------------------------------------------------------------------------------------------------\n A person who fought for everything,\n Including the normal right of humans \n A victim of discrimination,\n But never went under frustration. \n The way to solve problems, \n And the way to fight back,\n For the usual human rights,\n Even for the righteousness.<"
  },
  {
    "IDs":321102,
    "Content":"Essay on Dr. B. R. Ambedkar’s life inspires me to…..",
    "Link":"http://www.brainly.in/question/321102",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई मे"
  },
  {
    "IDs":321104,
    "Content":"Essay on Dr. B. R. Ambedkar’s views on women empowerment in hindi",
    "Link":"http://www.brainly.in/question/321104",
    "Answer":"दोनों प्रणालीगत स्तर पर और पितृसत्ता के कामकाज पर जाति का संचालन, नारीवादी राजनीतिक बहस में बढ़ जाति / वर्ग डिवाइड महिलाओं की उत्पीड़न, सामाजिक लोकतंत्र, जाति और हिन्दू सामाजिक व्यवस्था और दर्शन, आधुनिक भारतीय नारीवादी सोच के लिए महत्वपूर्ण पर अम्बेडकर के दृश्य बनाता है । हालांकि अम्बेडकर ने साबित कर दिया है, खुद को एक प्रतिभाशाली होने के लिए और एक महान विचारक, दार्शनिक, क्रांतिकारी, विधिवेत्ता के रूप में जाना जाता था - ख़ासकर, विपुल लेखक, सामाजिक कार्यकर्ता और आलोचक और उनकी मृत्यु, अपने विचारों के इधार भारतीय सामाजिक राजनीतिक परिदृश्य में एक बादशाह की तरह खड़े रहे भारतीय समाज की व्यापकता सिर्फ इसलिए कि वह एक अछूत के रूप में पैदा हुआ था में पर्याप्त ध्यान कभी नहीं मिला। हालांकि, समकालीन सामाजिक वास्तविकताओं वारंट उसकी विषयों की विस्तृत श्रृंखला की परीक्षा पास करने, उसकी दृष्टि की चौड़ाई, उसके विश्लेषण की गहराई, और अपने दृष्टिकोण की समझदारी और वहाँ व्यावहारिक कार्रवाई के लिए उनके सुझाव के आवश्यक मानवता। इसलिए, भारतीय महिलाओं के आंदोलन के लिए अम्बेडकर एक नारीवादी राजनीतिक एजेंडा है जो एक साथ समकालीन सामाजिक राजनीति की स्थापना की, जो अभी भी कई मामलों में रूढ़िवादी और प्रतिक्रियावादी मूल्यों रहता में वर्ग, जाति और लिंग के मुद्दों के पते तैयार करने के लिए, विशेष रूप से पर प्रेरणा का एक शक्तिशाली स्रोत प्रदान करता है लिंग संबंधों। लेखन और अम्बेडकर के भाषण क्या महत्व देता है भारत का विकास करना चाहिए और कैसे वे अपने सामाजिक और राजनीतिक संस्थाओं का आधुनिकीकरण होगा दिखा। अम्बेडकर दमनकारी, जाति आधारित है और कठोर श्रेणीबद्ध सामाजिक व्यवस्था के शिकार के रूप में महिलाओं को देखा।"
  },
  {
    "IDs":321105,
    "Content":"Poem on Dr. B. R. Ambedkar’s life inspires me to…..",
    "Link":"http://www.brainly.in/question/321105",
    "Answer":"------------------------------------------------------------------------------------------------\n Dr. B. R. Ambedkar \n------------------------------------------------------------------------------------------------\n\nWe all were scattered only because of the caste and religious system, \nThe discrimination faced, the struggle we went under is really painful,\nBut the love towards our nation never died and we tried to be in unity \nThe life of yours Dr. B. R. Ambedkar is really inspiring us a lot, We youngsters learned too many inspiring things from you, \nYour urge towards our the constitution of our country is really strong, \nThe compulsion and the determination towards the goal \nThat is the great constitution of indi"
  },
  {
    "IDs":321108,
    "Content":"Poster on What do I know about Dr. B. R. Ambedkar",
    "Link":"http://www.brainly.in/question/321108",
    "Answer":"how anyone can make a poster on a text answer"
  },
  {
    "IDs":321109,
    "Content":"Essay on What do I know about Dr. B. R. Ambedkar in hindi",
    "Link":"http://www.brainly.in/question/321109",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई में शामिल हो गए और प्राप्त उसकी डिग्री वहीं एक प्रोफेसर के रूप में अपना कैरियर शुरू किया और चार साल के लिए कार्य किया। वह भारत लौट आए जब वह बड़ौदा में सैनिक सचिव नियुक्त किया गया था, लेकिन वह भेदभाव के कारण नौकरी छोड़ दी, और बंबई में ले जाया गया। अम्बेडकर गहरा हरिजनों के लिए बाहर अंतर उपचार पर चोट लगी थी। डॉ अम्बेडकर चंडाल वेलफेयर सोसायटी का गठन किया और तथाकथित अछूत का आयोजन उनके लिए उसकी लड़ाई आरंभ करने के लिए। वह उनके बीच जागरूकता पैदा करने के लिए एक सुंदर जीवन है। उन्होंने चंदन टैंक पर एक सत्याग्रह का शुभारंभ किया। उन्होंने कहा कि दलितों के जीवन में एक परिवर्तन के बारे में लाने के लिए कड़ी मेहनत की कोशिश की। उन्होंने कहा कि जो 'फूट डालो और राज करो' की नीति में विश्वास ब्रिटिश सरकार के सभी का समर्थन किया था। सभी अपने जीवन के माध्यम से डॉ अम्बेडकर समाज के कमजोर वर्गों के उत्थान के लिए संघर्ष किया। उन्होंने कहा कि संविधान बनाने समिति की मसौदा समिति के अध्यक्ष बने। वह गहरी दुनिया के विभिन्न संविधानों का अध्ययन किया और उनके अच्छे अंक बाहर ले गए। उन्होंने कहा कि भारतीय संविधान में उन सभी बिंदुओं को ग्रहण कर लेता है। वह ठीक ही भारतीय संविधान के संस्थापक पिता कहा जाता है।"
  },
  {
    "IDs":321110,
    "Content":"Poem on What do I know about Dr. B. R. Ambedkar in hindi",
    "Link":"http://www.brainly.in/question/321110",
    "Answer":"Ek Mahan yodha hai Jo Kabhi Na Mane kum Kisi Ko Kisi Se woh Amisha jitne ki Umeed Ki sainng Apne Jeevan ko dusro ke liye Arpit Karke Yeh Bastille logo ke Yaadon Mein aur dil may haruki image Jane iss naam se Dr.B.R.Ambedkar"
  },
  {
    "IDs":321111,
    "Content":"Essay on Dr. B. R. Ambedkar’s ideas for progressive India in hindi",
    "Link":"http://www.brainly.in/question/321111",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई में"
  },
  {
    "IDs":321112,
    "Content":"Poster on Dr. B. R. Ambedkar: a great leader",
    "Link":"http://www.brainly.in/question/321112",
    "Answer":"hope it helpssss..........................."
  },
  {
    "IDs":321113,
    "Content":"Poster on Dr. B. R. Ambedkar’s ideas for progressive India",
    "Link":"http://www.brainly.in/question/321113",
    "Answer":"hope it helps u .................."
  },
  {
    "IDs":321114,
    "Content":"Essay on Dr. B. R. Ambedkar: a great leader",
    "Link":"http://www.brainly.in/question/321114",
    "Answer":"Born: 14 April, 1891 \nPassed Away: 6, December, 1956\n\nContribution\nDr B R Ambedkar, popularly known as Babasaheb Ambedkar, was one of the architects of the Indian Constitution. He was a well-known politician and an eminent jurist. Ambedkar's efforts to eradicate the social evils like untouchablity and caste restrictions were remarkable. The leader, throughout his life, fought for the rights of the dalits and other socially backward classes. Ambedkar was appointed as the nation's first Law Minister in the Cabinet of Jawaharlal Nehru. He was posthumously awarded the Bharat Ratna, India's highest civilian honor in 1990. \n\nHis Life\nBhimrao Ambedkar was born to Bhimabai Sakpal and Ramji on 14 April 1891 in Madhya Pradesh. He was the fourteenth child of his parents. Ambedkar;s father was a Subedar in the Indian Army and posted at Mhow cantonment, MP. After the retirement of his father in 1894, the family moved to satara. Shortly aft"
  },
  {
    "IDs":321116,
    "Content":"Poem on Dr. B. R. Ambedkar: the key architect of the constitution of India in hindi",
    "Link":"http://www.brainly.in/question/321116",
    "Answer":"desh k liye jinhonene vilas ko thukraya tha ,\ngire huon ko jinhonene swabiman sikhaya tha,\njisne ham sabkho tufano se takrana sikhaya tha\ndesh ka tha anmol wo deepak jo\"baba saheb\"kehalaya tha \naaj uski batho ko hum dil se apnayenge \nsab miljulkar anbedkar jeyanthi manayenge .\n\n\nhope this helps you :)))))"
  },
  {
    "IDs":321117,
    "Content":"Essay on Dr. B. R. Ambedkar’s life inspires me to….. in hindi",
    "Link":"http://www.brainly.in/question/321117",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई में"
  },
  {
    "IDs":321118,
    "Content":"Poem on Dr. B. R. Ambedkar’s ideas for progressive India",
    "Link":"http://www.brainly.in/question/321118",
    "Answer":"------------------------------------------------------------------------------------------------\n Dr. B. R. Ambedkar \n------------------------------------------------------------------------------------------------\n\nThe progressive india is the dream india of ours. \nLoving india isn't just enough but \nworking on it is more important than just dreaming, \nWorking out on the best would probably be awesome than \nJust dreaming up on the same thing all time isn't enough \nDr. B. R. Ambedkar worked hard against the social sins \nThat is the discrimination based on the caste system, \nA sorrowful situation but yet inspiring ways to fight it back it. \nThe love towards the country would never die,"
  },
  {
    "IDs":321119,
    "Content":"Poster on Dr. B. R. Ambedkar’s views on women empowerment",
    "Link":"http://www.brainly.in/question/321119",
    "Answer":"hope it helps..............................."
  },
  {
    "IDs":321120,
    "Content":"Poster on Dr. B. R. Ambedkar’s life inspires me to…..",
    "Link":"http://www.brainly.in/question/321120",
    "Answer":"hope it helps..........................."
  },
  {
    "IDs":321121,
    "Content":"Poem on Dr. B. R. Ambedkar’s life inspires me to….. in hindi",
    "Link":"http://www.brainly.in/question/321121",
    "Answer":"Desh K Liye Jinhonene Vilas Ko Thukraya Tha,\nGire Huon Ko Jinhonene Swabiman Sikhaya Tha,\nJisne Hum Sabko Toofano Se Takrana Sikhaya Tha\nDesh Ka Tha Anmol Wo Deepak Jo “Baba Saheb” Kehlaya Tha.\nAaj Uski Baato Ko Hum Dil Se Apnayenge\nSab Miljulkar Ambedkar Jayanti Manaynge\nKar Gujar Gaye Wo Bhim The\nDuniya Ko Jagaane waale Bhim The\nHamne To Sirf Itihaas Padha hai Yaaron\nItihaas Banane waale Mere Bhim The.\n\nSir Uncha Uthakar Jina Sikhaya Mere Bhim Ne\nShiksha Ka Mahatwa Samjhaya Mere Bhim Ne\nJulm Ke Khilaf Sangharsh Karna Sikhaya Mere Bhim Ne,\nAaj Mai Bahot Uncha Utha Hun,\nMujhe Uncha Uthaya Mere Bhim Ne\nSara Jaha Hai Jiki Sharan Me\nNaman Hi Us BABA Ke Charan Me\nBane Us Baba Ke Charno Ki Dhool\nAao Mil Kar Chadhaye Shradha Ke Phool"
  },
  {
    "IDs":321122,
    "Content":"Essay on Dr. B. R. Ambedkar: the key architect of the constitution of India",
    "Link":"http://www.brainly.in/question/321122",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई मे"
  },
  {
    "IDs":321123,
    "Content":"Poem on Dr. B. R. Ambedkar: the key architect of the constitution of India",
    "Link":"http://www.brainly.in/question/321123",
    "Answer":"------------------------------------------------------------------------------------------------\n Dr. B. R. Ambedkar \n------------------------------------------------------------------------------------------------\n\nthe constitution of India, \nthe power of the citizens of India, \nlong ago people of India made whimper out of pain and discrimination, \nwith shrillness notes of anger and pain \nthe foes never wanted that independence to be given to us,\nbut yet we wished and that happened to us. \nthat independence and the rights which we have are only because of, \nthe greatest of greatest leader and social reformer Dr. B. R. Ambedkar,\nthe constitution and the right and regulations make our life easy and,"
  },
  {
    "IDs":321124,
    "Content":"Essay on Dr. B. R. Ambedkar: a great leader in hindi",
    "Link":"http://www.brainly.in/question/321124",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई में"
  },
  {
    "IDs":321125,
    "Content":"Poem on Dr. B. R. Ambedkar’s views on women empowerment in hindi",
    "Link":"http://www.brainly.in/question/321125",
    "Answer":"महिला सशक्तिकरण के बारे में अंबेडकर जी के विचार\n\n\nऊँच-नीच के भेद भाव में बचपन बीता, तुम नया करना चाहे,\nजिसने संसार में जन्म दिया, उन नारियों का अपमान सह न पाए I\nअपमानित होती, गुलामी की जंजीरों में जकड़ी, दस बनी,\nसती होती, अक्षर ज्ञान से वंचित, विधवा पर जुल्म तुम सह न पाए II\n18"
  },
  {
    "IDs":321126,
    "Content":"Essay on Dr. B. R. Ambedkar’s ideas for progressive India",
    "Link":"http://www.brainly.in/question/321126",
    "Answer":"Bhimrao Ramji Ambedkar, also known as Babasaheb was born on April 14, 1891. Ambedkar was born in the British founded town and military cantonment of Mhow in the central provinces. He was the 14th and the last child of Ramji Maloji Sakpal and Bhimabai Murbadkar. His family belonged to a Marathi background from the town of Ambavade in the Ratnagiri district of modern day Maharashtra.\n\nHis father served in the Indian Army at Mhow cantonment. Ambedkar received a degree of formal education in Marathi and English.\n\nThey were from Hindu Mahar Caste, who were treated as untouchables. Though he attended the school but he was given no attention by the teachers. He was not even allowed to sit in the class. Overcoming numerous social and financial obstacles, Ambedkar passed his matriculation examination in 1907 and entered the University of Bombay, becoming one of the first persons of untouchable origin to enter a college in India. He was married to a nine year old girl, Ramabai from Dapoli in 1908."
  },
  {
    "IDs":321127,
    "Content":"Poem on Dr. B. R. Ambedkar’s ideas for progressive India in hindi",
    "Link":"http://www.brainly.in/question/321127",
    "Answer":"The poem on the topic Dr. B. R. Ambedkar :\nप्रगतिशील भारत हमारा सपनो का भारत है।\nविकास के लिए हमें बहुत कोशिश करना पडता है ।\nइसके लिए अंबेडकर जी ने बहुत कोशिश किया था।\nलोग कहते है समाज मे भेदभाव सामान्य है ।\nपर भेदभाव बहुत दर्दनाक होती है ।\nभारत मे प्रगतिशील बहुत मुसखि है क्य़ोकि\nयह के लोग अब भी मानते है कि अंधविश्वा"
  },
  {
    "IDs":321129,
    "Content":"Poster on Dr. B. R. Ambedkar: the key architect of the constitution of India",
    "Link":"http://www.brainly.in/question/321129",
    "Answer":"hope it helps..........................."
  },
  {
    "IDs":321130,
    "Content":"Poem on Dr. B. R. Ambedkar: a great leader in hindi",
    "Link":"http://www.brainly.in/question/321130",
    "Answer":"Desh K Liye Jinhonene Vilas Ko Thukraya Tha,\nGire Huon Ko Jinhonene Swabiman Sikhaya Tha,\nJisne Hum Sabko Toofano Se Takrana Sikhaya Tha\nDesh Ka Tha Anmol Wo Deepak Jo “Baba Saheb” Kehlaya Tha.\nAaj Uski Baato Ko Hum Dil Se Apnayenge\nSab Miljulkar Ambedkar Jayanti Manaynge\n\nKar Gujar Gaye Wo Bhim The\nDuniya Ko Jagaane waale Bhim The\nHamne To Sirf Itihaas Padha hai Yaaron\nItihaas Banane waale Mere Bhim The.\n\n\nSir Uncha Uthakar Jina Sikhaya Mere Bhim Ne\nShiksha Ka Mahatwa Samjhaya Mere Bhim Ne\nJulm Ke Khilaf Sangharsh Karna Sikhaya Mere Bhim Ne,\nAaj Mai Bahot Uncha Utha Hun,\nMujhe Uncha Uthaya Mere Bhim Ne\n\nSara Jaha Hai Jiki Sharan Me\nNaman Hi Us BABA Ke Charan Me\nBane Us Baba Ke Charno Ki Dhool\nAao Mil Kar Chadhaye Shradha Ke Phool"
  },
  {
    "IDs":321131,
    "Content":"Poem on Dr. B. R. Ambedkar: a great leader",
    "Link":"http://www.brainly.in/question/321131",
    "Answer":"----------------------------------------------------------------------------------------------- Dr. B. R Ambedkar \n------------------------------------------------------------------------------------------------\n A person who fought for everything,\n Including the normal right of humans \n A victim of discrimination,\n But never went under frustration. \n The way to solve problems, \n And the way to fight back,\n For the usual human rights,"
  },
  {
    "IDs":321128,
    "Content":"Essay on Dr. B. R. Ambedkar: the key architect of the constitution of India in hindi",
    "Link":"http://www.brainly.in/question/321128",
    "Answer":"डॉ भीमराव अम्बेडकर ने भारतीय संविधान के वास्तुकार था। उन्होंने 14 अप्रैल 1891 महू में मध्य प्रदेश में इंदौर के पास पर हरिजन के एक निम्न जाति के परिवार में पैदा हुआ था। डॉ अम्बेडकर रमाबाई के साथ चौदह साल की एक अपरिपक्व उम्र में शादी की थी। डॉ अम्बेडकर, हालांकि, उनकी पढ़ाई जारी रखी। उन्होंने निशान के अच्छे प्रतिशत के साथ इंटरमीडिएट की परीक्षा उत्तीर्ण की। उन्होंने एल्फिंस्टन कॉलेज, मुंबई में"
  },
  {
    "IDs":321133,
    "Content":"Essay on What do I know about Dr. B. R. Ambedkar",
    "Link":"http://www.brainly.in/question/321133",
    "Answer":"Bhimrao Ramji Ambedkar, also known as Babasaheb was born on April 14, 1891.He was the 14th and the last child of Ramji Maloji Sakpal and Bhimabai Murbadkar. His family belonged to a Marathi background from the town of Ambavade in the Ratnagiri district of modern day Maharashtra.His father served in the Indian Army. Ambedkar received a degree of formal education in Marathi and English.They were from Hindu Mahar Caste, who were treated as untouchables. Though he attended the school but he was given no attention by the teachers. He was not even allowed to sit in the class.He was married to a nine year old girl, Ramabai from Dapoli in 1908.Ambedkar had been suffering from diabetes since 1948.From June to October in 1954, he was bed ridden owing to clinical depression and failing eyesight. He died in his sleep on December 6, 1956 at his home in Delhi.He was an Indian nationalist, jurist, dalit, Buddhist, political leader and a Buddhist revivalist. He was also the chief architect of the Indian Constitution. Ambedka"
  }
]
